vlm/base/Documents/СчетФактураПолученный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СчетФактураПолученный</Name>
			<BasedOn>
				<xr:Item>Document.ПриобретениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПриобретениеУслугПрочихАктивов</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтКлиента</xr:Item>
				<xr:Item>Document.ВыкупВозвратнойТарыУПоставщика</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
				<xr:Item>Document.ОтчетПереработчика</xr:Item>
				<xr:Item>Document.ВыкупПринятыхНаХранениеТоваров</xr:Item>
				<xr:Item>Document.ОтчетПереработчика2_5</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПоНДС</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеРасходы</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВРеглУчете</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.ФактическиеДанныеБюджетирования</xr:Item>
				<xr:Item>AccountingRegister.МеждународныйБезКорреспонденции</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.ОтражениеДокументовВМеждународномУчете</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
				<xr:Item>InformationRegister.ЖурналУчетаСчетовФактур</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корректировочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактураОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученВЭлектронномВиде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтнестиКПредыдущемуОтчетномуКварталу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписиКнигиПокупок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленКомиссионеромОтИмениПродавца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СводныйКомиссионный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперацииНаУменьшение</Name>
					<Comment>Код вида операции при уменьшении стоимости (количества)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СводныйКорректировочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИНН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировкаЖурналаСФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировкаСуммДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписиКнигиПродаж</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеСчетФактураПолученный</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХозяйственнаяОперация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУвеличение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУменьшение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСУвеличение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСУменьшение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУвеличениеКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУменьшениеКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСУвеличениеКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСУменьшениеКомиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦенности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПринятоКВычетуНДСДоВводаОстатков</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСДоВводаОстатков</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продавцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННПродавца</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИНН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПППродавца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/CommonModules/ПроверкаКонтрагентовВызовСервераПереопределяемыйУТ/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Проверка контрагентов
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает таблицу счет-фактур, созданных на основании документа
//
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма документ, чьи счета-фактуры будут получены.
//
// Возвращаемое значение:
//   ТаблицаЗначений, Неопределено   - таблица, содержащая данные о счет-фактурах, выписанных на основании документа.
//
Функция ПолучитьКонтрагентовСчетФактурДокумента(Форма) Экспорт
	
	Если Форма.РеквизитыПроверкиКонтрагентов.Свойство("ДанныеСчетФактур") Тогда
		
		Если Форма.РеквизитыПроверкиКонтрагентов.ДанныеСчетФактур = Неопределено Тогда
			
			Возврат Неопределено;
			
		Иначе
			
			ТаблицаСчетФактур = Новый ТаблицаЗначений;
			ТаблицаСчетФактур.Колонки.Добавить("Дата");
			ТаблицаСчетФактур.Колонки.Добавить("Контрагент");
			ТаблицаСчетФактур.Колонки.Добавить("Ссылка");
			ТаблицаСчетФактур.Колонки.Добавить("ЕстьОшибки");
			ТаблицаСчетФактур.Колонки.Добавить("ТипСчетФактуры");
			
			Для Каждого ЭлементМассива Из Форма.РеквизитыПроверкиКонтрагентов.ДанныеСчетФактур Цикл
				
				НоваяСтрока = ТаблицаСчетФактур.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
				
			КонецЦикла;
			
			Возврат ТаблицаСчетФактур;
			
		КонецЕсли;
		
	КонецЕсли;

	ДокументСсылка = Форма.Объект.Ссылка;
	
	ТекстЗапроса = "";
	ТекстОбъединения = "";
	Объединить =
	"
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.СчетФактураВыданный) Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураВыданный.Контрагент,
		|	СчетФактураВыданный.Ссылка,
		|	НАЧАЛОПЕРИОДА(СчетФактураВыданный.Дата, ДЕНЬ) Дата,
		|	ЛОЖЬ КАК ЕстьОшибки,
		|	ТИПЗНАЧЕНИЯ(СчетФактураВыданный.Ссылка) КАК ТипСчетФактуры
		|ПОМЕСТИТЬ СчетФактураВыданныйВременная
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование
		|	И СчетФактураВыданный.Проведен
		|	И НЕ СчетФактураВыданный.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|;
		|";
		ТекстОбъединения = "ВЫБРАТЬ РАЗЛИЧНЫЕ * ИЗ СчетФактураВыданныйВременная";
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.СчетФактураПолученный) Тогда
		ТекстЗапросаСчетФактураПолученный = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Контрагент,
		|	СчетФактураПолученный.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактураПолученный.Исправление
		|			ТОГДА НАЧАЛОПЕРИОДА(СчетФактураПолученный.ДатаИсправления, ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(СчетФактураПолученный.Дата, ДЕНЬ)
		|	КОНЕЦ КАК Дата,
		|	ЛОЖЬ КАК ЕстьОшибки,
		|	ТИПЗНАЧЕНИЯ(СчетФактураПолученный.Ссылка) КАК ТипСчетФактуры
		|ПОМЕСТИТЬ СчетФактураПолученныйВременная
		|ИЗ
		|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|		ПО СчетФактураПолученныйДокументыОснования.Ссылка = СчетФактураПолученный.Ссылка
		|ГДЕ
		|	СчетФактураПолученныйДокументыОснования.ДокументОснование = &ДокументОснование
		|	И СчетФактураПолученный.Проведен
		|	И НЕ СчетФактураПолученный.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|;
		|";
		ТекстОбъединенияЗапросаСчетФактураПолученный = "ВЫБРАТЬ РАЗЛИЧНЫЕ * ИЗ СчетФактураПолученныйВременная";
		
		Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаСчетФактураПолученный;
			ТекстОбъединения = ТекстОбъединения + Объединить + ТекстОбъединенияЗапросаСчетФактураПолученный;
		Иначе
			ТекстЗапроса = ТекстЗапросаСчетФактураПолученный;
			ТекстОбъединения = ТекстОбъединенияЗапросаСчетФактураПолученный;
		КонецЕсли;
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.СчетФактураПолученныйНалоговыйАгент) Тогда
		ТекстЗапросаСчетФактураПолученныйНА = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураПолученный.Контрагент,
		|	СчетФактураПолученный.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактураПолученный.Исправление
		|			ТОГДА НАЧАЛОПЕРИОДА(СчетФактураПолученный.ДатаИсправления, ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(СчетФактураПолученный.Дата, ДЕНЬ)
		|	КОНЕЦ КАК Дата,
		|	ЛОЖЬ КАК ЕстьОшибки,
		|	ТИПЗНАЧЕНИЯ(СчетФактураПолученный.Ссылка) КАК ТипСчетФактуры
		|ПОМЕСТИТЬ СчетФактураПолученныйНАВременная
		|ИЗ
		|	Документ.СчетФактураПолученныйНалоговыйАгент.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйНалоговыйАгент КАК СчетФактураПолученный
		|		ПО СчетФактураПолученныйДокументыОснования.Ссылка = СчетФактураПолученный.Ссылка
		|ГДЕ
		|	СчетФактураПолученныйДокументыОснования.ДокументОснование = &ДокументОснование
		|	И СчетФактураПолученный.Проведен
		|	И НЕ СчетФактураПолученный.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|;
		|";
		ТекстОбъединенияЗапросаСчетФактураПолученныйНА = "ВЫБРАТЬ РАЗЛИЧНЫЕ * ИЗ СчетФактураПолученныйНАВременная";
		
		Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаСчетФактураПолученныйНА;
			ТекстОбъединения = ТекстОбъединения + Объединить + ТекстОбъединенияЗапросаСчетФактураПолученныйНА;
		Иначе
			ТекстЗапроса = ТекстЗапросаСчетФактураПолученныйНА;
			ТекстОбъединения = ТекстОбъединенияЗапросаСчетФактураПолученныйНА;
		КонецЕсли;
	КонецЕсли;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.СчетФактураКомиссионеру) Тогда
		ТекстЗапросаСчетФактураКомиссионеру = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураКомиссионеру.Комиссионер,
		|	СчетФактураКомиссионеру.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактураКомиссионеру.ДатаВыставления = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА НАЧАЛОПЕРИОДА(СчетФактураКомиссионеру.Дата, ДЕНЬ)
		|		ИНАЧЕ СчетФактураКомиссионеру.ДатаВыставления
		|	КОНЕЦ КАК Дата,
		|	ЛОЖЬ КАК ЕстьОшибки,
		|	ТИПЗНАЧЕНИЯ(СчетФактураКомиссионеру.Ссылка) КАК ТипСчетФактуры
		|ПОМЕСТИТЬ СчетФактураКомиссионеруВременная
		|ИЗ
		|	Документ.СчетФактураКомиссионеру КАК СчетФактураКомиссионеру
		|ГДЕ
		|	СчетФактураКомиссионеру.ДокументОснование = &ДокументОснование
		|	И СчетФактураКомиссионеру.Проведен
		|	И НЕ СчетФактураКомиссионеру.Комиссионер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураКомиссионеруПокупатели.Покупатель,
		|	СчетФактураКомиссионеру.Ссылка,
		|	ВЫБОР
		|		КОГДА СчетФактураКомиссионеру.ДатаВыставления = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА НАЧАЛОПЕРИОДА(СчетФактураКомиссионеру.Дата, ДЕНЬ)
		|		ИНАЧЕ СчетФактураКомиссионеру.ДатаВыставления
		|	КОНЕЦ КАК Дата,
		|	ЛОЖЬ,
		|	ТИПЗНАЧЕНИЯ(СчетФактураКомиссионеру.Ссылка)
		|ПОМЕСТИТЬ СчетФактураКомиссионеруПокупателиВременная
		|ИЗ
		|	Документ.СчетФактураКомиссионеру.Покупатели КАК СчетФактураКомиссионеруПокупатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураКомиссионеру КАК СчетФактураКомиссионеру
		|		ПО СчетФактураКомиссионеруПокупатели.Ссылка = СчетФактураКомиссионеру.Ссылка
		|ГДЕ
		|	СчетФактураКомиссионеру.ДокументОснование = &ДокументОснование
		|	И СчетФактураКомиссионеру.Проведен
		|	И СчетФактураКомиссионеруПокупатели.Покупатель ССЫЛКА Справочник.Контрагенты
		|	И НЕ СчетФактураКомиссионеруПокупатели.Покупатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|;
		|";
		ТекстОбъединенияСчетФактураКомиссионеру =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ * ИЗ СчетФактураКомиссионеруВременная
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ * ИЗ СчетФактураКомиссионеруПокупателиВременная";
		
		Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаСчетФактураКомиссионеру;
			ТекстОбъединения = ТекстОбъединения + Объединить + ТекстОбъединенияСчетФактураКомиссионеру;
		Иначе
			ТекстЗапроса = ТекстЗапросаСчетФактураКомиссионеру;
			ТекстОбъединения = ТекстОбъединенияСчетФактураКомиссионеру;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		Запрос = Новый Запрос(ТекстЗапроса + ТекстОбъединения);
		Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылка);
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			
			ТаблицаСчетовФактур = Результат.Выгрузить();
			
			ДанныеСчетФактур = Новый Массив;
			Для Каждого СтрокаТаблицы Из ТаблицаСчетовФактур Цикл
				
				ДанныеСчетФактуры = Новый Структура;
				ДанныеСчетФактуры.Вставить("Дата",           СтрокаТаблицы.Дата );
				ДанныеСчетФактуры.Вставить("Контрагент",     СтрокаТаблицы.Контрагент );
				ДанныеСчетФактуры.Вставить("Ссылка",         СтрокаТаблицы.Ссылка );
				ДанныеСчетФактуры.Вставить("ЕстьОшибки",     СтрокаТаблицы.ЕстьОшибки );
				ДанныеСчетФактуры.Вставить("ТипСчетФактуры", СтрокаТаблицы.ТипСчетФактуры );
				
			КонецЦикла;
			
			Форма.РеквизитыПроверкиКонтрагентов.Вставить("ДанныеСчетФактур", ДанныеСчетФактур);
			
			Возврат ТаблицаСчетовФактур;
		Иначе
			
			Форма.РеквизитыПроверкиКонтрагентов.Вставить("ДанныеСчетФактур", Неопределено);
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Дополнительные действия, выполняемые при создании на сервере документа, в котором используется "Проверка контрагентов".
//
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, для которой дополняются действия при создании на сервере.
//
Процедура ФормаДокументаПриСозданииНаСервере(Форма) Экспорт

	ПроверкаИспользуется                 = Форма.РеквизитыПроверкиКонтрагентов.ПроверкаИспользуется;
	Если НЕ ПартнерыИКонтрагенты.ЕстьРеквизитФормы(Форма,"ИспользоватьПартнеровКакКонтрагентов") Тогда
		ИспользоватьПартнеровКакКонтрагентов = Ложь;
	Иначе
		ИспользоватьПартнеровКакКонтрагентов = Форма.ИспользоватьПартнеровКакКонтрагентов;
	КонецЕсли;
	
	Описание = ПроверкаКонтрагентов.ОписаниеДокументов(Форма);
	Для Каждого СтрокаОписание Из Описание Цикл
		
		ПараметрыЭлементаФормы = СтрокаОписание.Элемент;
		Если ПараметрыЭлементаФормы.ОтключатьВидимостьБезусловно <> Неопределено Тогда
			ПараметрыЭлементаФормы.ОтключатьВидимостьБезусловно.Видимость = Ложь;
		КонецЕсли;
		Если Не ПроверкаИспользуется Тогда
			Если ПараметрыЭлементаФормы.ВидОтображения = "УправлениеСтраницами" Тогда
				ПараметрыЭлементаФормы.ГруппаСтраниц.Видимость = Ложь;
			ИначеЕсли ПараметрыЭлементаФормы.ВидОтображения = "Видимость" Тогда
				ПараметрыЭлементаФормы.ЭлементУправлениеВидимостью.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Форма.РеквизитыПроверкиКонтрагентов.ЭтоДокументСКонтрагентомВТабличнойЧасти Тогда
		
		Если Не Форма.РеквизитыПроверкиКонтрагентов.ПроверкаИспользуется Тогда
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЭтоНекорректныйКонтрагент", "Видимость", Ложь);
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "АвансыПоставщикамЭтоНекорректныйКонтрагент", "Видимость", Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует структуру описания параметров оформляемого документа
//
// Возвращаемое значение:
//   Структура   - пустая структура описания оформляемого документа.
//
Функция СтруктураПараметровОформляемогоЭлемента() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидОтображения","");
	СтруктураПараметров.Вставить("ЭлементУправлениеВидимостью",Неопределено);
	СтруктураПараметров.Вставить("СтраницаЕстьПроблема", Неопределено);
	СтруктураПараметров.Вставить("СтраницаНетПроблемы", Неопределено);
	СтруктураПараметров.Вставить("ГруппаСтраниц",Неопределено);
	СтруктураПараметров.Вставить("ОтключатьВидимостьБезусловно",Неопределено);
	СтруктураПараметров.Вставить("ЭлементФормыПодсказка",Неопределено);
	СтруктураПараметров.Вставить("Имя",Неопределено);

	Возврат СтруктураПараметров;
	
КонецФункции

// Управление видимостью элементов, относящихся к проверке контрагентов в формах справочника "Контрагенты" при создании
// на сервере. Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма, для которой выполняются действия.
//
Процедура ПриСозданииНаСервереУправлениеВидимостью(Форма) Экспорт

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
	                                                             "ГруппаРезультатПроверкиКонтрагентов", 
	                                                             "Видимость", 
	                                                             Форма.РеквизитыПроверкиКонтрагентов.ПроверкаИспользуется);

КонецПроцедуры

#КонецОбласти
